.svn/pristine/88/885b3e96b575aa83cab1e7274c5dab661f2bff36.svn-base

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:req="http://ngcomplexq.ops.newgen.com/schema/Ngcomplex/request">
    <soapenv:Header/>
    <soapenv:Body>
        <req:ComplexReq>
            <Option>CREATE_SP_NB_TPD</Option>
            <Username>System</Username>
            <Password>9kbXBdSqUi7LH2BSXYnhfQ==</Password>
            <InputFile>
                <![CDATA[
                <OnlineSalesDataSets><OnlineSalesDataSet>
                <!--InsurersDetail_Start-->
                <OnlineSalesDataTable>
                    <RowCount>___member_count___</RowCount>
                    <CCS_APPLICATION_NUMBER>___customer_id___</CCS_APPLICATION_NUMBER>
                    <CCS_CONTACT_CODE>Null</CCS_CONTACT_CODE>
                    <MB_WEB_UW_COMPLETE_DATE />
                    <CCS_PROPOSER_TITLE>___salutation___</CCS_PROPOSER_TITLE>
                    <FIRST_NAME>___first_name___</FIRST_NAME>
                    <MIDDLE_NAME>___middle_name___</MIDDLE_NAME>
                    <LAST_NAME>___last_name___</LAST_NAME>
                    <GENDER>___proposer_gender___</GENDER>
                    <DOB>___birth_date___</DOB>
                    <NATIONALITY>Indian</NATIONALITY>
                    <MARITAL_STATUS>___marital___</MARITAL_STATUS>
                    <EMAIL_ID>___email___</EMAIL_ID>
                    <PAN_NUMBER>___pan___</PAN_NUMBER>
                    <MOBILE>___mobile___</MOBILE>
                    <ALTERNATE_NUMBER />
                    <AADHAR_NUMBER />
                    <LANDLINE_NUMBER/>
                    <EDUCATIONAL_QUALIFICATION></EDUCATIONAL_QUALIFICATION>
                    <OCCUPATION>___occupation___</OCCUPATION>
                    <OCCUPATION_OTHERS />
                    <CCS_CAMPAIGN_CODE>820</CCS_CAMPAIGN_CODE>
                    <CHANNEL>TPD</CHANNEL>
                    <CCS_INSURED_COUNT>___member_count___</CCS_INSURED_COUNT>
                    <PREMIUM_AMOUNT>___final_premium___</PREMIUM_AMOUNT>
                    <PREMIUM_PAID_BY>___first_name___ ___middle_name___ ___last_name___</PREMIUM_PAID_BY>
                    <RELATIONSHIP_WITH_PROPOSER>___member_array_relation___</RELATIONSHIP_WITH_PROPOSER>
                    <CURRENT_PERMANENT_ADDRESS>0</CURRENT_PERMANENT_ADDRESS>
                    <PERMANENT_ADDRESS>1</PERMANENT_ADDRESS>
                    <CURRENT_ADDRESS>0</CURRENT_ADDRESS>
                    <PERMANENT_ADDRESS_LINE1>___permanent_address_1___</PERMANENT_ADDRESS_LINE1>
                    <PERMANENT_ADDRESS_LINE2>___permanent_address_2___</PERMANENT_ADDRESS_LINE2>
                    <PERMANENT_ADDRESS_LINE3>___permanent_address_3___</PERMANENT_ADDRESS_LINE3>
                    <PERMANENT_CITY>___city___</PERMANENT_CITY>
                    <CCS_PERMANENT_DISTRICT />
                    <PERMANENT_STATE>___state___</PERMANENT_STATE>
                    <PERMANENT_PINCODE>___permanent_pincode___</PERMANENT_PINCODE>
                    <CURRENT_ADDRESS_LINE1>___permanent_address_1___</CURRENT_ADDRESS_LINE1>
                    <CURRENT_ADDRESS_LINE2>___permanent_address_2___ </CURRENT_ADDRESS_LINE2>
                    <CURRENT_ADDRESS_LINE3>___permanent_address_3___</CURRENT_ADDRESS_LINE3>
                    <CURRENT_CITY>___city___</CURRENT_CITY>
                    <CCS_CURRENT_DISTRICT />
                    <CURRENT_STATE>___state___</CURRENT_STATE>
                    <CURRENT_PINCODE>___permanent_pincode___</CURRENT_PINCODE>
                    <COMMUNICATION_ADDRESS_LINE1>___permanent_address_1___</COMMUNICATION_ADDRESS_LINE1>
                    <COMMUNICATION_ADDRESS_LINE2>___permanent_address_2___</COMMUNICATION_ADDRESS_LINE2>
                    <COMMUNICATION_ADDRESS_LINE3>___permanent_address_3___</COMMUNICATION_ADDRESS_LINE3>
                    <COMMUNICATION_CITY>___city___</COMMUNICATION_CITY>
                    <CCS_COMMUNICATION_DISTRICT />
                    <COMMUNICATION_STATE>___state___</COMMUNICATION_STATE>
                    <COMMUNICATION_PINCODE>___permanent_pincode___</COMMUNICATION_PINCODE>
                    <MB_RURAL_FLAG>Null</MB_RURAL_FLAG>
                    <MB_GROSS_ANNUAL_INCOME>___annual_income___</MB_GROSS_ANNUAL_INCOME>
                    <LEAD_ID>Null</LEAD_ID>
                    <PEP_QUESTION_1>___proposer_pep___</PEP_QUESTION_1>
                    <PROCESS_MASTER />
                    <LEAD_STAGE />
                    <LEAD_STATUS />
                    <TELESALES_ASSIGNED_TO>Null</TELESALES_ASSIGNED_TO>
                    <DST_ASSIGNED_TO>Null</DST_ASSIGNED_TO>
                    <CCS_FOLLOW_UP_DATE>Null</CCS_FOLLOW_UP_DATE>
                    <CCS_LOGGED>Null</CCS_LOGGED>
                    <CCS_LOGGED_DATE>Null</CCS_LOGGED_DATE>
                    <CCS_FOLLOW_UP_TIME>Null</CCS_FOLLOW_UP_TIME>
                    <CCS_TEAM />
                    <CCS_SELF_EMP />
                    <MEDICAL_TEST_NEEDED>Null</MEDICAL_TEST_NEEDED>
                    <MEDICAL_SCHEDULED_DATE>Null</MEDICAL_SCHEDULED_DATE>
                    <BANK_NAME_PD />
                    <BANK_BRANCH />
                    <BANK_CITY_PD />
                    <ACCOUNT_NUMBER />
                    <BRANCH />
                    <BRANCH_IFSC />
                    <ACCOUNT_TYPE />
                    <MEDICAL_SCHEDULED_TIME_TXT />
                    <CCS_POL_RNWD />
                    <CCS_SMS_NOTIF />
                    <CCS_SAL_DESG />
                    <CCS_FAMILY_PH_NAME />
                    <CCS_PH_ADDRESS_LINE_1 />
                    <CCS_PH_ADDRESS_LINE_2 />
                    <CCS_PH_ADDRESS_LINE_3 />
                    <CCS_PH_CITY />
                    <CCS_PH_STATE />
                    <CCS_PH_PINCODE>0</CCS_PH_PINCODE>
                    <CCS_EXS_INSURED_DT />
                    <F1 />
                    <BANK_BRANCH_NAME>Online Payment</BANK_BRANCH_NAME>
                    <F2 />
                    <CASH>Null</CASH>
                    <CHEQUE>Null</CHEQUE>
                    <CHEQUE_NUMBER>___customer_id___</CHEQUE_NUMBER>
                    <AMOUNT>___final_premium___</AMOUNT>
                    <CCS_PAYMENT_DATE>___policy_received_date___</CCS_PAYMENT_DATE>
                    <CCS_CASH_CHEQUE />
                    <NOMINEE_NAME>___nominee_name___</NOMINEE_NAME>
                    <NOMINEE_DOB>___nominee_birth_date___</NOMINEE_DOB>
                    <NOMINEE_APPOINTEE_NAME />
                    <NOMINEE_RELATIONSHIP>___nominee_relation___</NOMINEE_RELATIONSHIP>
                    <NOMINEE_ADDRESS>___nominee_address___</NOMINEE_ADDRESS>
                    <NOMINEE_CONTACT_NUMBER></NOMINEE_CONTACT_NUMBER>
                    <CCS_PLAN_ID>___planCode___</CCS_PLAN_ID>
                    <PAYMENT_RECEIVED_FLAG>1</PAYMENT_RECEIVED_FLAG>
                    <CCS_APP_FLAG>Null</CCS_APP_FLAG>
                    <CCS_APP_FLAG_NUMERIC>Null</CCS_APP_FLAG_NUMERIC>
                    <WEB_INSURED_ID>___member_array_id___</WEB_INSURED_ID>
                    <INSURED_TITLE>___member_array_salutation___</INSURED_TITLE>
                    <INSURED_FIRST_NAME>___member_array_first_name___</INSURED_FIRST_NAME>
                    <INSURED_MIDDLE_NAME>___member_array_middle_name___</INSURED_MIDDLE_NAME>
                    <INSURED_LAST_NAME>___member_array_last_name___</INSURED_LAST_NAME>
                    <INSURED_GENDER>___member_array_gender_2___</INSURED_GENDER>
                    <INSURED_HEIGHT>___member_array_height___</INSURED_HEIGHT>
                    <INSURED_WEIGHT>___member_array_weight___</INSURED_WEIGHT>
                    <INSURED_DATE_OF_BIRTH>___member_array_birth_date___</INSURED_DATE_OF_BIRTH>
                    <INSURED_WAISTLINE></INSURED_WAISTLINE>
                    <INSURED_OCCUPATION>___member_array_occupation___</INSURED_OCCUPATION>
                    <INSURED_RELATIONSHIP_PROPOSER>___member_array_relation___</INSURED_RELATIONSHIP_PROPOSER>
                    <INSURED_HEIGHT_INCH></INSURED_HEIGHT_INCH>
                    <INSURED_HEIGHT_FEET></INSURED_HEIGHT_FEET>
                    <EDUCATIONAL_QUALIFICATION_x0020__x0028_Insured_x0029_></EDUCATIONAL_QUALIFICATION_x0020__x0028_Insured_x0029_>
                    <MB_PEP_QUESTION_1>___member_array_pep___</MB_PEP_QUESTION_1>
                    <MB_PAST_PROPOSALS>___member_array_question_35_details___</MB_PAST_PROPOSALS>
                    <SOCIAL_SECTOR />
                    <CCS_DESIGNATION_OCCUPATION />
                    <CHECKUP>0</CHECKUP>
                    <BMI>___member_array_bmi___</BMI>
                    <INSURED_Q1>___member_array_question_21_details___</INSURED_Q1>
                    <INSURED_Q2>___member_array_question_22_details___</INSURED_Q2>
                    <INSURED_Q3>___member_array_question_23_details___</INSURED_Q3>
                    <INSURED_Q4>___member_array_question_24_details___</INSURED_Q4>
                    <INSURED_QSECTION_B1>___member_array_question_2_details___</INSURED_QSECTION_B1>
                    <INSURED_QSECTION_B2>___member_array_question_3_details___</INSURED_QSECTION_B2>
                    <INSURED_QSECTION_B3>___member_array_question_4_details___</INSURED_QSECTION_B3>
                    <INSURED_QSECTION_B4>___member_array_question_5_details___</INSURED_QSECTION_B4>
                    <INSURED_QSECTION_B5>___member_array_question_6_details___</INSURED_QSECTION_B5>
                    <INSURED_QSECTION_B6>___member_array_question_7_details___</INSURED_QSECTION_B6>
                    <INSURED_QSECTION_B7>___member_array_question_8_details___</INSURED_QSECTION_B7>
                    <INSURED_QSECTION_B8>___member_array_question_9_details___</INSURED_QSECTION_B8>
                    <INSURED_QSECTION_B9>___member_array_question_10_details___</INSURED_QSECTION_B9>
                    <INSURED_QSECTION_B10>___member_array_question_11_details___</INSURED_QSECTION_B10>
                    <INSURED_QSECTION_B11>___member_array_question_12_details___</INSURED_QSECTION_B11>
                    <INSURED_QSECTION_B12>___member_array_question_13_details___</INSURED_QSECTION_B12>
                    <INSURED_QSECTION_B13>___member_array_question_25_details___</INSURED_QSECTION_B13>
                    <INSURED_QSECTION_C>___member_array_question_14_details___</INSURED_QSECTION_C>
                    <INSURED_QSECTION_C1A>___member_array_question_15_details___</INSURED_QSECTION_C1A>
                    <INSURED_QSECTION_C1B>___member_array_question_16_details___</INSURED_QSECTION_C1B>
                    <INSURED_QSECTION_C1C>___member_array_question_27_details___</INSURED_QSECTION_C1C>
                    <INSURED_QSECTION_C1D>___member_array_question_28_details___</INSURED_QSECTION_C1D>
                    <INSURED_QSECTION_C2>___member_array_question_17_details___</INSURED_QSECTION_C2>
                    <INSURED_QSECTION_D>___member_array_question_18_details___</INSURED_QSECTION_D>
                    <INSURED_QSECTION_D1>___member_array_question_29_details___</INSURED_QSECTION_D1>
                    <INSURED_QSECTION_D2>___member_array_question_19_details___</INSURED_QSECTION_D2>
                    <!--___member_array_preg_Start-->
                    <INSURED_QSECTION_E1A>___member_array_pregnancy_information_subQue_1___</INSURED_QSECTION_E1A>
                    <INSURED_QSECTION_E1B>___member_array_pregnancy_information_subQue_2___</INSURED_QSECTION_E1B>
                    <INSURED_QSECTION_E1C>___member_array_pregnancy_information_subQue_3___</INSURED_QSECTION_E1C>
                    <INSURED_QSECTION_E1D>___member_array_pregnancy_information_subQue_4___</INSURED_QSECTION_E1D>
                    <INSURED_QSECTION_E2>___member_array_pregnancy_information_subQue_5___</INSURED_QSECTION_E2>
                    <INSURED_QSECTION_E3>___member_array_pregnancy_information_subQue_6___</INSURED_QSECTION_E3>
                    <!--___member_array_preg_End-->
                    <INSURED_TOBACCO_QUESTION>___member_array_question_26_details1___</INSURED_TOBACCO_QUESTION>
                    <INSURED_TOBACCO_QUANTITY>___member_array_question_26_details___</INSURED_TOBACCO_QUANTITY>
                    <INSURED_ALCOHOL_QUESTION>___member_array_consumes_alcohol___</INSURED_ALCOHOL_QUESTION>
                    <INSURED_BEER_QUANTITY>___member_array_question_30_details___</INSURED_BEER_QUANTITY>
                    <INSURED_WINE_QUANTITY>___member_array_question_31_details___</INSURED_WINE_QUANTITY>
                    <INSURED_SPIRIT_QUANTITY>___member_array_question_32_details___</INSURED_SPIRIT_QUANTITY>
                    <INSURED_CIGARETTES_QUESTION>___member_array_question_33_details1___</INSURED_CIGARETTES_QUESTION>
                    <INSURED_CIGARETTES_QUANTITY>___member_array_question_33_details___</INSURED_CIGARETTES_QUANTITY>
                    <INSURED_DRUGS_QUESTION>___member_array_question_34_details1___</INSURED_DRUGS_QUESTION>
                    <INSURED_DRUGS_QUANTITY>___member_array_question_34_details___</INSURED_DRUGS_QUANTITY>
                    <!--___member_array_aqblock_Start-->
                    <ADDITIONAL_MEDICAL_DETAILS>
                        <ADDITIONAL_MEDICAL_DETAIL>
                            <QUESTION />
                            <INSURED_DIAGNOSIS_DETAILS>___member_array_additionalQue_1_subQue_1___</INSURED_DIAGNOSIS_DETAILS>
                            <INSURED_DIAGNOSIS_ONSET>___member_array_additionalQue_1_onset___</INSURED_DIAGNOSIS_ONSET>
                            <INSURED_DURATION_CONDITION>___member_array_additionalQue_1_subQue_5___</INSURED_DURATION_CONDITION>
                            <INSURED_MEDICATION>___member_array_additionalQue_1_subQue_2___</INSURED_MEDICATION>
                            <INSURED_DOSAGE>___member_array_additionalQue_1_subQue_7___</INSURED_DOSAGE>
                            <INSURED_TREATMENT_OUTCOME>___member_array_additionalQue_1_subQue_3___</INSURED_TREATMENT_OUTCOME>
                            <INSURED_DOCTOR_DETAILS>___member_array_additionalQue_1_subQue_6___</INSURED_DOCTOR_DETAILS>
                            <INSURED_DOCUMENT_ATTACHED>0</INSURED_DOCUMENT_ATTACHED>
                        </ADDITIONAL_MEDICAL_DETAIL>
                        <!--___member_array_block2_Start-->
                        <ADDITIONAL_MEDICAL_DETAIL>
                            <QUESTION />
                            <INSURED_DIAGNOSIS_DETAILS>___member_array_additionalQue_2_subQue_1___</INSURED_DIAGNOSIS_DETAILS>
                            <INSURED_DIAGNOSIS_ONSET>___member_array_additionalQue_2_onset___</INSURED_DIAGNOSIS_ONSET>
                            <INSURED_DURATION_CONDITION>___member_array_additionalQue_2_subQue_5___</INSURED_DURATION_CONDITION>
                            <INSURED_MEDICATION>___member_array_additionalQue_2_subQue_2___</INSURED_MEDICATION>
                            <INSURED_DOSAGE>___member_array_additionalQue_2_subQue_7___</INSURED_DOSAGE>
                            <INSURED_TREATMENT_OUTCOME>___member_array_additionalQue_2_subQue_3___</INSURED_TREATMENT_OUTCOME>
                            <INSURED_DOCTOR_DETAILS>___member_array_additionalQue_2_subQue_6___</INSURED_DOCTOR_DETAILS>
                            <INSURED_DOCUMENT_ATTACHED>0</INSURED_DOCUMENT_ATTACHED>
                        </ADDITIONAL_MEDICAL_DETAIL>
                        <!--___member_array_block2_End-->
                    </ADDITIONAL_MEDICAL_DETAILS>
                    <!--___member_array_aqblock_End-->
                    <MB_MEDICAL_QUESTION_D_1>___member_array_question_1_details___</MB_MEDICAL_QUESTION_D_1>
                    <!--___member_array_familyHistory_Start-->
                    <FAMILY_MEDICAL_HISTORY_SET>
                        <FAMILY_MEDICAL_HISTORY>
                            <PROPOSER_RELATION>___member_array_family_history_subQue_1___</PROPOSER_RELATION>
                            <DISEASE_DISORDER>___member_array_family_history_subQue_2___</DISEASE_DISORDER>
                            <IS_ALIVE>___member_array_family_history_subQue_3___</IS_ALIVE>
                            <AGE>___member_array_family_history_subQue_4___</AGE>
                            <CAUSE_OF_DEATH>___member_array_family_history_subQue_5___</CAUSE_OF_DEATH>
                            <AGE_AT_DEATH>___member_array_family_history_subQue_6___</AGE_AT_DEATH>
                            <AGE_AT_ONSET>___member_array_family_history_subQue_7___</AGE_AT_ONSET>
                        </FAMILY_MEDICAL_HISTORY>
                    </FAMILY_MEDICAL_HISTORY_SET>
                    <!--___member_array_familyHistory_End-->
                    <NAME>___member_array_first_name___ ___member_array_middle_name___ ___member_array_last_name___</NAME>
                    <AGE_PROOF />
                    <RESIDENCE_PROOF />
                    <ID_PROOF />
                    <ID_PROOF_COMMENTS />
                    <RESIDENCE_PROOF_COMMENTS />
                    <AGE_PROOF_COMMENTS />
                    <CLAIM_DETAILS />
                    <CCS_SUM_INSURED />
                    <INSURED_FROM />
                    <INSURED_TO />
                    <Mb_Sales_Branch>Mumbai</Mb_Sales_Branch>
                    <Agent_Assigned_To>BR00330027</Agent_Assigned_To>
                    <CCS_INSURED_FLAG>Null</CCS_INSURED_FLAG>
                    <CCS_INSURED_FLAG_NUMERIC>Null</CCS_INSURED_FLAG_NUMERIC>
                    <Policy_Term>___policy_tenure___</Policy_Term>
                    <Bill_Cycle>___policy_tenure___</Bill_Cycle>
                    <Tier></Tier>
                    <HCB>0</HCB>
                    <mb_ecs_flag>0</mb_ecs_flag>
                    <mb_cost_sharing>NO</mb_cost_sharing>
                    <mb_email_id_notification />
                    <mb_nationality>Indian</mb_nationality>
                    <STP_Flag>___stp_flag___</STP_Flag>
                    <Policy_Number />
                    <Transaction_Number>_</Transaction_Number>
                    <Cumulative_Amount>___final_premium___</Cumulative_Amount>
                    <LOYALTY_OPTION>SI</LOYALTY_OPTION>
                    <HARD_COPY_REQUIRED>___hard_copy___</HARD_COPY_REQUIRED>
                    <IS_EIA_Account>___has_eia___</IS_EIA_Account>
                    <EIA_Number>___eia_number___</EIA_Number>
                    <IR_Name>___ir_name___</IR_Name>
                </OnlineSalesDataTable>
                <!--InsurersDetail_End--> 
            </OnlineSalesDataSet></OnlineSalesDataSets>
               ]]>
            </InputFile>
            <nextSeedValue></nextSeedValue>
        </req:ComplexReq>
    </soapenv:Body>
</soapenv:Envelope>